MERGE INTO `account` KEY (id) VALUES
    (1, 'admin@msproject.com', '$2a$04$JTfvNB8C4nR8rFgjYWt.1uXobJ6VYw9vFaJ9xTevEHfQ50c9zkUta', 'admin', 0, 1, '2024-01-01 00:00:00', 'SYSTEM', '2024-01-01 00:00:00', 'SYSTEM'),
    (2, 'qhshef@msproject.com', '$2a$04$JTfvNB8C4nR8rFgjYWt.1uXobJ6VYw9vFaJ9xTevEHfQ50c9zkUta', 'MS KIM', 0, 1, '2024-01-02 00:00:00', 'SYSTEM', '2024-01-02 00:00:00', 'SYSTEM');

MERGE INTO `menu_group` KEY (id) VALUES
    (1, '커피', 0, 1, '2024-01-01 00:00:00', 'SYSTEM', '2024-01-01 00:00:00', 'SYSTEM'),
    (2, '디카페인', 1, 1, '2024-01-01 00:00:00', 'SYSTEM', '2024-01-01 00:00:00', 'SYSTEM'),
    (3, '콜드브루', 2, 1, '2024-01-01 00:00:00', 'SYSTEM', '2024-01-01 00:00:00', 'SYSTEM');

MERGE INTO `menu` KEY (id) VALUES
    (1, '바닐라 크럼블 아이스크림 라떼', 4900, 1, 0, '2024-01-01 00:00:00', 'SYSTEM', '2024-01-01 00:00:00', 'SYSTEM'),
    (2, '아샷추 아이스티', 3400, 1, 1, '2024-01-01 00:00:00', 'SYSTEM', '2024-01-01 00:00:00', 'SYSTEM'),
    (3, '믹스 커피', 3000, 1, 1, '2024-01-01 00:00:00', 'SYSTEM', '2024-01-01 00:00:00', 'SYSTEM'),
    (4, '아메리카노', 1600, 1, 1, '2024-01-01 00:00:00', 'SYSTEM', '2024-01-01 00:00:00', 'SYSTEM'),
    (5, '샷추가 아메리카노', 2000, 1, 1, '2024-01-01 00:00:00', 'SYSTEM', '2024-01-01 00:00:00', 'SYSTEM'),
    (6, '디카페인 바닐라 크럼블 아이스크림 라떼', 5600, 2, 1, '2024-01-01 00:00:00', 'SYSTEM', '2024-01-01 00:00:00', 'SYSTEM'),
    (7, '디카페인 아샷추 아이스티', 3600, 2, 1, '2024-01-01 00:00:00', 'SYSTEM', '2024-01-01 00:00:00', 'SYSTEM'),
    (8, '디카페인 아메리카노', 2300, 2, 1, '2024-01-01 00:00:00', 'SYSTEM', '2024-01-01 00:00:00', 'SYSTEM'),
    (9, '디카페인 꿀 커피', 3000, 2, 1, '2024-01-01 00:00:00', 'SYSTEM', '2024-01-01 00:00:00', 'SYSTEM'),
    (10, '콜드부르', 2300, 3, 1, '2024-01-01 00:00:00', 'SYSTEM', '2024-01-01 00:00:00', 'SYSTEM'),
    (11, '콜드브루 라떼', 3000, 3, 1, '2024-01-01 00:00:00', 'SYSTEM', '2024-01-01 00:00:00', 'SYSTEM'),
    (12, '돌체 콜드브루 라떼', 3500, 3, 1, '2024-01-01 00:00:00', 'SYSTEM', '2024-01-01 00:00:00', 'SYSTEM');

MERGE INTO `option_group` KEY (id) VALUES
    (1, '컵 선택', '2024-01-01 00:00:00', 'SYSTEM', '2024-01-01 00:00:00', 'SYSTEM'),
    (2, 'HOT ONLY', '2024-01-01 00:00:00', 'SYSTEM', '2024-01-01 00:00:00', 'SYSTEM'),
    (3, 'ICE ONLY', '2024-01-01 00:00:00', 'SYSTEM', '2024-01-01 00:00:00', 'SYSTEM'),
    (4, 'HOT & ICE', '2024-01-01 00:00:00', 'SYSTEM', '2024-01-01 00:00:00', 'SYSTEM');

MERGE INTO `option` KEY (id) VALUES
    (1, '일회용컵 사용', 1, 0, '2024-01-01 00:00:00', 'SYSTEM', '2024-01-01 00:00:00', 'SYSTEM'),
    (2, '개인컵 사용', 1, 0, '2024-01-01 00:00:00', 'SYSTEM', '2024-01-01 00:00:00', 'SYSTEM'),
    (3, '매장컵(먹고 갈게요)', 1, 0, '2024-01-01 00:00:00', 'SYSTEM', '2024-01-01 00:00:00', 'SYSTEM'),
    (4, 'HOT ONLY', 2, 0, '2024-01-01 00:00:00', 'SYSTEM', '2024-01-01 00:00:00', 'SYSTEM'),
    (5, 'ICE ONLY', 3, 0, '2024-01-01 00:00:00', 'SYSTEM', '2024-01-01 00:00:00', 'SYSTEM'),
    (6, 'HOT', 4, 0, '2024-01-01 00:00:00', 'SYSTEM', '2024-01-01 00:00:00', 'SYSTEM'),
    (7, 'ICE', 4, 0, '2024-01-01 00:00:00', 'SYSTEM', '2024-01-01 00:00:00', 'SYSTEM');

MERGE INTO `menu_option_group` KEY (id) VALUES
    (1, 1, 1, 1, '2024-01-01 00:00:00', 'SYSTEM'),
    (2, 1, 3, 2, '2024-01-01 00:00:00', 'SYSTEM');

MERGE INTO `cart` KEY (id) VALUES
    (1, 1, 1, 1, '2024-01-01 00:00:00', 'SYSTEM'),
    (2, 1, 1, 1, '2024-01-01 00:00:00', 'SYSTEM'),
    (3, 1, 1, 1, '2024-01-01 00:00:00', 'SYSTEM'),
    (4, 1, 1, 1, '2024-01-01 00:00:00', 'SYSTEM');
